Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2C.xml
        <module name="SMAP" id="I8321" version="1.0.0">
          <instance name="SMAP">
            <register-group name="SMAP" name-in-module="SMAP" address-space="base" offset="0x400A3000"/>
          </instance>
        </module>
        <module name="SPI" id="I7602" version="2.1.1">
          <instance name="SPI">
            <register-group name="SPI" name-in-module="SPI" address-space="base" offset="0x40008000"/>
            <signals>
              <signal group="MISO" function="B" pad="PA03"/>
              <signal group="MISO" function="B" pad="PB14"/>
              <signal group="MISO" function="B" pad="PC28"/>
              <signal group="MISO" function="A" pad="PA21"/>
              <signal group="MISO" function="A" pad="PA27"/>
              <signal group="MISO" function="A" pad="PC04"/>
              <signal group="MOSI" function="B" pad="PB15"/>
              <signal group="MOSI" function="B" pad="PC29"/>
              <signal group="MOSI" function="A" pad="PA22"/>
              <signal group="MOSI" function="A" pad="PA28"/>
              <signal group="MOSI" function="A" pad="PC05"/>
              <signal group="NPCS" index="0" function="B" pad="PA02"/>
              <signal group="NPCS" index="0" function="B" pad="PC31"/>
              <signal group="NPCS" index="0" function="A" pad="PA24"/>
              <signal group="NPCS" index="0" function="A" pad="PA30"/>
              <signal group="NPCS" index="0" function="A" pad="PC03"/>
              <signal group="NPCS" index="1" function="C" pad="PA13"/>
              <signal group="NPCS" index="1" function="B" pad="PB13"/>
              <signal group="NPCS" index="1" function="A" pad="PA31"/>
              <signal group="NPCS" index="1" function="A" pad="PC02"/>
              <signal group="NPCS" index="2" function="C" pad="PA14"/>
              <signal group="NPCS" index="2" function="B" pad="PB11"/>
              <signal group="NPCS" index="2" function="A" pad="PC00"/>
              <signal group="NPCS" index="3" function="C" pad="PA15"/>
              <signal group="NPCS" index="3" function="B" pad="PB12"/>
              <signal group="NPCS" index="3" function="A" pad="PC01"/>
              <signal group="SCK" function="B" pad="PC30"/>
              <signal group="SCK" function="A" pad="PA23"/>
              <signal group="SCK" function="A" pad="PA29"/>
              <signal group="SCK" function="A" pad="PC06"/>
            </signals>
            <parameters>
              <param name="CS_MSB" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="I7604" version="4.0.2">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40010000"/>
            <signals>
              <signal group="A0" function="D" pad="PB07"/>
              <signal group="A0" function="B" pad="PA08"/>
              <signal group="A1" function="D" pad="PB09"/>
              <signal group="A1" function="B" pad="PA10"/>
              <signal group="A2" function="D" pad="PB11"/>
              <signal group="A2" function="B" pad="PA12"/>
              <signal group="B0" function="D" pad="PB08"/>
              <signal group="B0" function="B" pad="PA09"/>
              <signal group="B1" function="D" pad="PB10"/>
              <signal group="B1" function="B" pad="PA11"/>
              <signal group="B2" function="D" pad="PB12"/>
              <signal group="B2" function="B" pad="PA13"/>
              <signal group="CLK0" function="D" pad="PB13"/>
              <signal group="CLK0" function="B" pad="PA14"/>
              <signal group="CLK1" function="D" pad="PB14"/>
              <signal group="CLK1" function="B" pad="PA15"/>
              <signal group="CLK2" function="D" pad="PB15"/>
              <signal group="CLK2" function="B" pad="PA16"/>
            </signals>
            <parameters>
              <param name="CLK_DIV1" value="gen_clk_tc0"/>
              <param name="CLK_DIV2" value="2"/>
              <param name="CLK_DIV3" value="8"/>
              <param name="CLK_DIV4" value="32"/>
              <param name="CLK_DIV5" value="128"/>
              <param name="GCLK_NUM" value="5"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40014000"/>
            <signals>
              <signal group="A0" function="D" pad="PC00"/>
              <signal group="A0" function="A" pad="PC15"/>
              <signal group="A1" function="D" pad="PC02"/>
              <signal group="A1" function="A" pad="PC17"/>
              <signal group="A2" function="D" pad="PC04"/>
              <signal group="A2" function="A" pad="PC19"/>
              <signal group="B0" function="D" pad="PC01"/>
              <signal group="B0" function="A" pad="PC16"/>
              <signal group="B1" function="D" pad="PC03"/>
              <signal group="B1" function="A" pad="PC18"/>
              <signal group="B2" function="D" pad="PC05"/>
              <signal group="B2" function="A" pad="PC20"/>
              <signal group="CLK0" function="D" pad="PC06"/>
              <signal group="CLK0" function="A" pad="PC21"/>
              <signal group="CLK1" function="D" pad="PC07"/>
              <signal group="CLK1" function="A" pad="PC22"/>
              <signal group="CLK2" function="D" pad="PC08"/>
              <signal group="CLK2" function="A" pad="PC23"/>
            </signals>
            <parameters>
              <param name="CLK_DIV1" value="gen_clk_tc1"/>
              <param name="CLK_DIV2" value="2"/>
              <param name="CLK_DIV3" value="8"/>
              <param name="CLK_DIV4" value="32"/>
              <param name="CLK_DIV5" value="128"/>
              <param name="GCLK_NUM" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="I7643" version="1.0.3">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x40068000"/>
