Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2C.xml
        <module name="USBC" id="I7553" version="3.1.0">
          <instance name="USBC">
            <register-group name="USBC" name-in-module="USBC" address-space="base" offset="0x400A5000"/>
            <signals>
              <signal group="DM" function="A" pad="PA25"/>
              <signal group="DP" function="A" pad="PA26"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="7"/>
              <param name="GCLK_NUM" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="I7528" version="5.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x400F0C00"/>
            <parameters>
              <param name="WDT_KEY_CONST" value="85"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M4 Hard Fault Interrupt"/>
        <interrupt name="MemoryManagement_IRQn" index="-12" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt name="BusFault_IRQn" index="-11" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt name="UsageFault_IRQn" index="-10" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt name="DebugMonitor_IRQn" index="-4" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt name="HFLASHC_IRQn" index="0" module-instance="HFLASHC"/>
        <interrupt name="PDCA_0_IRQn" index="1" module-instance="PDCA"/>
        <interrupt name="PDCA_1_IRQn" index="2" module-instance="PDCA"/>
        <interrupt name="PDCA_2_IRQn" index="3" module-instance="PDCA"/>
        <interrupt name="PDCA_3_IRQn" index="4" module-instance="PDCA"/>
        <interrupt name="PDCA_4_IRQn" index="5" module-instance="PDCA"/>
        <interrupt name="PDCA_5_IRQn" index="6" module-instance="PDCA"/>
        <interrupt name="PDCA_6_IRQn" index="7" module-instance="PDCA"/>
        <interrupt name="PDCA_7_IRQn" index="8" module-instance="PDCA"/>
        <interrupt name="PDCA_8_IRQn" index="9" module-instance="PDCA"/>
        <interrupt name="PDCA_9_IRQn" index="10" module-instance="PDCA"/>
        <interrupt name="PDCA_10_IRQn" index="11" module-instance="PDCA"/>
        <interrupt name="PDCA_11_IRQn" index="12" module-instance="PDCA"/>
        <interrupt name="PDCA_12_IRQn" index="13" module-instance="PDCA"/>
        <interrupt name="PDCA_13_IRQn" index="14" module-instance="PDCA"/>
        <interrupt name="PDCA_14_IRQn" index="15" module-instance="PDCA"/>
        <interrupt name="PDCA_15_IRQn" index="16" module-instance="PDCA"/>
        <interrupt name="CRCCU_IRQn" index="17" module-instance="CRCCU"/>
        <interrupt name="USBC_IRQn" index="18" module-instance="USBC"/>
        <interrupt name="PEVC_TR_IRQn" index="19" module-instance="PEVC"/>
        <interrupt name="PEVC_OV_IRQn" index="20" module-instance="PEVC"/>
        <interrupt name="PM_IRQn" index="22" module-instance="PM"/>
        <interrupt name="SCIF_IRQn" index="23" module-instance="SCIF"/>
        <interrupt name="FREQM_IRQn" index="24" module-instance="FREQM"/>
        <interrupt name="GPIO_0_IRQn" index="25" module-instance="GPIO"/>
        <interrupt name="GPIO_1_IRQn" index="26" module-instance="GPIO"/>
        <interrupt name="GPIO_2_IRQn" index="27" module-instance="GPIO"/>
        <interrupt name="GPIO_3_IRQn" index="28" module-instance="GPIO"/>
        <interrupt name="GPIO_4_IRQn" index="29" module-instance="GPIO"/>
        <interrupt name="GPIO_5_IRQn" index="30" module-instance="GPIO"/>
        <interrupt name="GPIO_6_IRQn" index="31" module-instance="GPIO"/>
        <interrupt name="GPIO_7_IRQn" index="32" module-instance="GPIO"/>
        <interrupt name="GPIO_8_IRQn" index="33" module-instance="GPIO"/>
        <interrupt name="GPIO_9_IRQn" index="34" module-instance="GPIO"/>
        <interrupt name="GPIO_10_IRQn" index="35" module-instance="GPIO"/>
        <interrupt name="GPIO_11_IRQn" index="36" module-instance="GPIO"/>
        <interrupt name="BPM_IRQn" index="37" module-instance="BPM"/>
        <interrupt name="BSCIF_IRQn" index="38" module-instance="BSCIF"/>
        <interrupt name="AST_ALARM_IRQn" index="39" module-instance="AST"/>
        <interrupt name="AST_PER_IRQn" index="40" module-instance="AST"/>
        <interrupt name="AST_OVF_IRQn" index="41" module-instance="AST"/>
        <interrupt name="AST_READY_IRQn" index="42" module-instance="AST"/>
        <interrupt name="AST_CLKREADY_IRQn" index="43" module-instance="AST"/>
        <interrupt name="WDT_IRQn" index="44" module-instance="WDT"/>
        <interrupt name="EIC_1_IRQn" index="45" module-instance="EIC"/>
        <interrupt name="EIC_2_IRQn" index="46" module-instance="EIC"/>
        <interrupt name="EIC_3_IRQn" index="47" module-instance="EIC"/>
        <interrupt name="EIC_4_IRQn" index="48" module-instance="EIC"/>
        <interrupt name="EIC_5_IRQn" index="49" module-instance="EIC"/>
        <interrupt name="EIC_6_IRQn" index="50" module-instance="EIC"/>
        <interrupt name="EIC_7_IRQn" index="51" module-instance="EIC"/>
        <interrupt name="EIC_8_IRQn" index="52" module-instance="EIC"/>
        <interrupt name="IISC_IRQn" index="53" module-instance="IISC"/>
        <interrupt name="SPI_IRQn" index="54" module-instance="SPI"/>
        <interrupt name="TC00_IRQn" index="55" module-instance="TC0"/>
        <interrupt name="TC01_IRQn" index="56" module-instance="TC0"/>
        <interrupt name="TC02_IRQn" index="57" module-instance="TC0"/>
        <interrupt name="TC10_IRQn" index="58" module-instance="TC1"/>
        <interrupt name="TC11_IRQn" index="59" module-instance="TC1"/>
        <interrupt name="TC12_IRQn" index="60" module-instance="TC1"/>
        <interrupt name="TWIM0_IRQn" index="61" module-instance="TWIM0"/>
        <interrupt name="TWIS0_IRQn" index="62" module-instance="TWIS0"/>
        <interrupt name="TWIM1_IRQn" index="63" module-instance="TWIM1"/>
        <interrupt name="TWIS1_IRQn" index="64" module-instance="TWIS1"/>
        <interrupt name="USART0_IRQn" index="65" module-instance="USART0"/>
        <interrupt name="USART1_IRQn" index="66" module-instance="USART1"/>
        <interrupt name="USART2_IRQn" index="67" module-instance="USART2"/>
        <interrupt name="USART3_IRQn" index="68" module-instance="USART3"/>
        <interrupt name="ADCIFE_IRQn" index="69" module-instance="ADCIFE"/>
        <interrupt name="DACC_IRQn" index="70" module-instance="DACC"/>
        <interrupt name="ACIFC_IRQn" index="71" module-instance="ACIFC"/>
        <interrupt name="ABDACB_IRQn" index="72" module-instance="ABDACB"/>
        <interrupt name="TRNG_IRQn" index="73" module-instance="TRNG"/>
        <interrupt name="PARC_IRQn" index="74" module-instance="PARC"/>
        <interrupt name="CATB_IRQn" index="75" module-instance="CATB"/>
        <interrupt name="TWIM2_IRQn" index="77" module-instance="TWIM2"/>
        <interrupt name="TWIM3_IRQn" index="78" module-instance="TWIM3"/>
      <!-- Cortex_M4 Devices Generic User Guide Table 2-16 -->
        <!--
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Cortex-M4 Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M4 Hard Fault Interrupt"/>
        <interrupt name="MemoryManagement_IRQn" index="-12" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt name="BusFault_IRQn" index="-11" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt name="UsageFault_IRQn" index="-10" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt name="DebugMonitor_IRQn" index="-4" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M4 System Tick Interrupt"/>
        -->
      </interrupts>
      <interfaces>
        <interface name="JTAG" type="samjtag"/>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="CHIPID_CIDR" value="0xAB0A07E0"/>
          <property name="CHIPID_EXID" value="0x04000002"/>
        </property-group>
      <property-group name="PROGRAMMING_INFO">
          <property name="FUSE_ENABLED_VALUE" value="0"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="ABDACB" id="I7563" version="1.0.0" caption="Audio Bitstream DAC">
      <register-group name="ABDACB" caption="Audio Bitstream DAC">
        <register name="CR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1" values="ABDACB_CR__EN"/>
          <bitfield name="SWAP" caption="Swap Channels" mask="0x2" values="ABDACB_CR__SWAP"/>
          <bitfield name="ALTUPR" caption="Alternative up-sampling ratio" mask="0x8"/>
          <bitfield name="CMOC" caption="Common mode offset control" mask="0x10"/>
          <bitfield name="MONO" caption="Mono mode" mask="0x20"/>
          <bitfield name="SWRST" caption="Software reset" mask="0x80"/>
          <bitfield name="DATAFORMAT" caption="Data word format" mask="0x70000"/>
          <bitfield name="FS" caption="Sampling frequency" mask="0xF000000"/>
        </register>
