Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2C.xml
        <register name="PMR0S" offset="0x14" rw="W" size="4" caption="Peripheral Mux Register 0 - Set">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
        <register name="PMR0C" offset="0x18" rw="W" size="4" caption="Peripheral Mux Register 0 - Clear">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
        <register name="PMR0T" offset="0x1C" rw="W" size="4" caption="Peripheral Mux Register 0 - Toggle">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
        <register name="PMR1" offset="0x20" rw="RW" size="4" caption="Peripheral Mux Register 1">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 1" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 1" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 1" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 1" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 1" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 1" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 1" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 1" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 1" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 1" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 1" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 1" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 1" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 1" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 1" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 1" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 1" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 1" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 1" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 1" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 1" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 1" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 1" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 1" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 1" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 1" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 1" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 1" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 1" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 1" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 1" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 1" mask="0x80000000"/>
        </register>
