Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2C.xml
        <register name="IMR0S" offset="0xA4" rw="W" size="4" caption="Interrupt Mode Register 0 - Set">
          <bitfield name="P0" caption="Interrupt Mode Bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Mode Bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Mode Bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Mode Bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Mode Bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Mode Bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Mode Bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Mode Bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Mode Bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Mode Bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Mode Bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Mode Bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Mode Bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Mode Bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Mode Bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Mode Bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Mode Bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Mode Bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Mode Bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Mode Bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Mode Bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Mode Bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Mode Bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Mode Bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Mode Bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Mode Bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Mode Bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Mode Bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Mode Bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Mode Bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Mode Bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Mode Bit 0" mask="0x80000000"/>
        </register>
        <register name="IMR0C" offset="0xA8" rw="W" size="4" caption="Interrupt Mode Register 0 - Clear">
          <bitfield name="P0" caption="Interrupt Mode Bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Mode Bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Mode Bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Mode Bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Mode Bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Mode Bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Mode Bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Mode Bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Mode Bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Mode Bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Mode Bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Mode Bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Mode Bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Mode Bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Mode Bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Mode Bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Mode Bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Mode Bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Mode Bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Mode Bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Mode Bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Mode Bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Mode Bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Mode Bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Mode Bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Mode Bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Mode Bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Mode Bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Mode Bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Mode Bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Mode Bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Mode Bit 0" mask="0x80000000"/>
        </register>
        <register name="IMR0T" offset="0xAC" rw="W" size="4" caption="Interrupt Mode Register 0 - Toggle">
          <bitfield name="P0" caption="Interrupt Mode Bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Mode Bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Mode Bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Mode Bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Mode Bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Mode Bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Mode Bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Mode Bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Mode Bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Mode Bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Mode Bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Mode Bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Mode Bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Mode Bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Mode Bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Mode Bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Mode Bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Mode Bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Mode Bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Mode Bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Mode Bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Mode Bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Mode Bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Mode Bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Mode Bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Mode Bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Mode Bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Mode Bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Mode Bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Mode Bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Mode Bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Mode Bit 0" mask="0x80000000"/>
        </register>
        <register name="IMR1" offset="0xB0" rw="RW" size="4" caption="Interrupt Mode Register 1">
          <bitfield name="P0" caption="Interrupt Mode Bit 1" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Mode Bit 1" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Mode Bit 1" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Mode Bit 1" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Mode Bit 1" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Mode Bit 1" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Mode Bit 1" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Mode Bit 1" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Mode Bit 1" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Mode Bit 1" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Mode Bit 1" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Mode Bit 1" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Mode Bit 1" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Mode Bit 1" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Mode Bit 1" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Mode Bit 1" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Mode Bit 1" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Mode Bit 1" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Mode Bit 1" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Mode Bit 1" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Mode Bit 1" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Mode Bit 1" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Mode Bit 1" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Mode Bit 1" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Mode Bit 1" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Mode Bit 1" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Mode Bit 1" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Mode Bit 1" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Mode Bit 1" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Mode Bit 1" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Mode Bit 1" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Mode Bit 1" mask="0x80000000"/>
        </register>
