Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2C.xml
      <value-group name="HMATRIXB_MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__ARBT">
        <value name="ROUND_ROBIN" caption="Round-Robin Arbitration" value="0"/>
        <value name="FIXED_PRIORITY" caption="Fixed Priority Arbitration" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB0">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB1">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB2">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB3">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB4">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB5">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB6">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB7">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB8">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB9">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB10">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB11">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB12">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB13">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB14">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB15">
        <value name="0" caption="Disable remapped address decoding for master" value="0"/>
        <value name="1" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
    </module>
    <module name="IISC" id="I7560" version="1.0.0" caption="Inter-IC Sound (I2S) Controller">
      <register-group name="IISC" caption="Inter-IC Sound (I2S) Controller">
        <register name="CR" offset="0x0" rw="W" size="4" caption="Control Register">
          <bitfield name="RXEN" caption="Receive Enable" mask="0x1" values="IISC_CR__RXEN"/>
          <bitfield name="RXDIS" caption="Receive Disable" mask="0x2" values="IISC_CR__RXDIS"/>
          <bitfield name="CKEN" caption="Clocks Enable" mask="0x4" values="IISC_CR__CKEN"/>
          <bitfield name="CKDIS" caption="Clocks Disable" mask="0x8" values="IISC_CR__CKDIS"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x10" values="IISC_CR__TXEN"/>
          <bitfield name="TXDIS" caption="Transmit Disable" mask="0x20" values="IISC_CR__TXDIS"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x80" values="IISC_CR__SWRST"/>
        </register>
        <register name="MR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="MODE" caption="Master/Slave/Controller Mode" mask="0x1" values="IISC_MR__MODE"/>
          <bitfield name="DATALENGTH" caption="Data Word Length" mask="0x1C" values="IISC_MR__DATALENGTH"/>
          <bitfield name="RXMONO" caption="Receiver Mono" mask="0x100" values="IISC_MR__RXMONO"/>
          <bitfield name="RXDMA" caption="Single or Multiple DMA Channels for Receiver" mask="0x200" values="IISC_MR__RXDMA"/>
          <bitfield name="RXLOOP" caption="Loop-back Test Mode" mask="0x400" values="IISC_MR__RXLOOP"/>
          <bitfield name="TXMONO" caption="Transmitter Mono" mask="0x1000" values="IISC_MR__TXMONO"/>
          <bitfield name="TXDMA" caption="Single or Multiple DMA Channels for Transmitter" mask="0x2000" values="IISC_MR__TXDMA"/>
          <bitfield name="TXSAME" caption="Transmit Data when Underrun" mask="0x4000" values="IISC_MR__TXSAME"/>
          <bitfield name="IMCKFS" caption="Master Clock to fs Ratio" mask="0x3F000000" values="IISC_MR__IMCKFS"/>
          <bitfield name="IMCKMODE" caption="Master Clock Mode" mask="0x40000000" values="IISC_MR__IMCKMODE"/>
          <bitfield name="IWS24" caption="IWS Data Slot Width" mask="0x80000000" values="IISC_MR__IWS24"/>
        </register>
